
/**
* \page CovelliteCoreBriefPage
*  Проект для кода ядра фреймворка.
*/

/**
* \page CovelliteCorePage Covellite.Core
*  
*  Список классов проекта \ref gCovelliteCoreClasses
*  
*  Введение
*  --------
*  
* \copydoc CovelliteCoreBriefPage
*  
*  Подробнее
*  ---------
*  
*  - Классы проекта инкапсулируют реализации под конкретную платформу
*  (общий заголовочный файл + отдельные реализации под Windows/Android).
*  - Код проекта предоставляет точку входа в приложение и вызов сигналов для 
*  системных/оконных сообщений.
*/
