
/**
* \page CovelliteCoreBriefPage
*  Проект для кода ядра фреймворка.
*  
* \deprecated
*  Код проекта устарел и будет удален в следующей стабильной версии, вместо
*  него использовать код из проектов \ref CovelliteAppPage и 
*  \ref CovelliteEventsPage.
*/

/**
* \page CovelliteCorePage Covellite.Core
*  
*  Список классов проекта \ref CovelliteCoreGroup
*  
*  Введение
*  --------
*  
* \copydoc CovelliteCoreBriefPage
*  
*  Подробнее
*  ---------
*  
*  - Классы проекта инкапсулируют реализации под конкретную платформу
*  (общий заголовочный файл + отдельные реализации под Windows/Android).
*  - Код проекта предоставляет точку входа в приложение и вызов сигналов для 
*  системных/оконных сообщений.
*/
