
/**
* \page CovelliteOsPage Covellite.Os
*  
*  Список классов проекта \ref gCovelliteOsClasses
*  
* \section sCovelliteOsBrief Введение
*  Проект классов, обеспечивающих взаимодействие с операционной системой.
*  
*  Подробнее
*  ---------
*  
*  - Классы проекта инкапсулируют реализации под конкретную платформу
*  (общий заголовочный файл + отдельные реализации под Windows/Android).
*  - Классы проекта обеспечивают собой универсальный 'фасад' для работы с окном 
*  операционной системы.
*/
