
#pragma once

namespace mock
{

// Сюда добавить пространства имен классов, которые в тестах должны быть
// заменены подставными объектами, например:
//namespace EnvDTE {}

} // namespace mock

// Сюда добавить пространства имен тестируемых классов и в них определить
// пространства имен подставных классов, например:
//
//namespace vs
//{
//
// Чтобы классы внутри пространства имен vs, объявленные в пространстве имен
// EnvDTE заменялись на классы из пространства имен mock::EnvDTE.
//namespace EnvDTE = mock::EnvDTE;
//
//} // namespace vs
