
/**
* \page CovelliteApiPage Covellite.Api
*  
*  Список классов проекта \ref gCovelliteApiClasses
*  
* \section sCovelliteApiBrief Введение
*  Проект классов-оберток для графического API.
*  
*  Подробнее
*  ---------
*  
*  - Классы проекта предоставляют реализации для различных графических API
*  (OpenGL/OpenGL ES/DirectX).
*  - Для каждого конкретного графического API создается отдельный класс.
*  - Каждый класс доступен только для использования в коде для конкретной 
*  платформы.
*/
